nota-conjdados-regressao.org
#+LATEX_COMPILER: xelatex

#+STARTUP: latexpreview

#+LATEX_HEADER: \hypersetup{colorlinks, allcolors=., urlcolor=blue!70!white}

#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usemintedstyle{lovelace}

* Análise de Regressão Linear Múltipla, Conjuntos de Dados
# ** [[file:data/csv/heart.csv::age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target][Heart Health]]
  # + Modelar uma contínua que estima saúde.
** [[https://www.kaggle.com/augustus0498/life-expectancy-who][Expectativa de Vida por País]]
  + *Modelar a variável expectativa de vida*
*** Sobre o =Conjunto=
  + Dados de todos países, derivados da OMS.
  # + Dividir em até 5 anos. (
  + Dados:
   - Country: país,
   - Year: ano correspondente aos dados,
   - Status: estado da industrialização,
   - Life expectancy: expectativa de vida,
   - Adult Mortality $15<\text{idade}<60$: mortalidade adulta por mil habitantes,
   - Infant deaths: mortalidade infantil por mil habitantes,
   - Alcohol: uso de álcool por litro puro (+15 anos),
   - Percentage expenditure: gasto em saúde em percentagem do PIB per capta,
   - Hepatitis B: percentagem de imunização entre bebês com um ano,
   - Measles: quantidade de casos reportados de Rubeola por mil habitantes,
   - BMI: média de index de massa corpórea da população,
   - under-five deaths: quantidade de mortes antes dos cinco anos por mil habitantes,
   - Polio: quantidade de imunização entre bebês com um ano (percentagem),
   - Total expenditure: percentagem do gasto total do governo com saúde,
   - Diphtheria: percentagem de imunização de tétano ($\leq 1 \text{ano}$),
   - HIV/AIDS: morte a cada mil nascimentos (contanto nascimento de 0-4 anos de idade),
   - GDP: PIB em dólares,
   - Population: População,
   - thinness  1-19 years: prevalescência de pessoas magras (1-19 anos de idade),
   - thinness 5-9 years: prevalescência de pessoas magras (5-9 anos de idade),
   - Income composition of resources: IDH (qualidade de vida) em termos de composição por salário pessoal (provida por salário próprio),
   - Schooling: média do número de anos sendo educado (escolaridade).
     
*** Como utilizar o conjunto (cópia de arquivo CSV, localmente)
O =conjunto= apenas está disponível por meio da [[https://drive.google.com/file/d/1nUnOwgAcWIqoyG0P5_wnlh1wPxxSUqv5/view?usp=sharing][cópia da núvem]], para o
computador local. Após baixar o arquivo =Life_Expectancy_Data.csv=,
para seu computador, a análise deve ser feita, em relação a um
determinado ano, a qual foi indicado ao grupo.

Por exemplo, para a análise da expectativa de vida, para o ano de
2015, seria feita invocamos os dados da seguinte maneira,

#+NAME: 9691c825-228e-4c3b-8f18-5fe87ed051ea
#+begin_src ein-r :session localhost :results output :exports both :eval no
  life <- read.csv('./data/csv/Life_Expectancy_Data.csv')
  life_2015 <- subset(life, Year=="2015")
  life_2015[1:6,1:5] 
#+end_src

#+RESULTS: 9691c825-228e-4c3b-8f18-5fe87ed051ea
:    Country             Year Status     Life.expectancy Adult.Mortality
: 1  Afghanistan         2015 Developing 65.0            263            
: 17 Albania             2015 Developing 77.8             74            
: 33 Algeria             2015 Developing 75.6             19            
: 49 Angola              2015 Developing 52.4            335            
: 65 Antigua and Barbuda 2015 Developing 76.4             13            
: 81 Argentina           2015 Developing 76.3            116            

Obs: apenas 5 colunas foram selecionadas, por motivos estéticos na formatação.

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-plm-cigar][Consumo de Cigarro]]
+ *Modelar quantidade de venda (sales)*.
*** Sobre o =Conjunto=
  + Usado em:
    * Baltagi, Badi H. (2001) Econometric Analysis of Panel Data, 2nd ed., John Wiley and Sons.
    * Baltagi, Badi H. (2013) Econometric Analysis of Panel Data, 5th ed., John Wiley and Sons.
    * Baltagi, B.H. and D. Levin (1992) “Cigarette taxation: raising revenues and reducing consumption”, Structural Changes and Economic Dynamics, 3(2), pp. 321–335.
    * Baltagi, B.H., J.M. Griffin and W. Xiong (2000) “To pool or not to pool: homogeneous versus heterogeneous estimators applied to cigarette demand”, Review of Economics and Statistics, 82(1), pp. 117–126.
  + Dados: anos 1963-1992
    - State: estados norte americanos, $\{1,2,3, \ldots, 51\}$.
    - Year: Anos 63-92.
    - Price: preço do maço.
    - Pop: população de fumantes.
    - Pop16: população acima de 16.
    - CPI: índice do preço (ideal) dado pelo consumidor.
    - NDI: Salário líquido per capta.
    - Sales: venda de cigarro por maço.
    - Pimin: preço mínimo de cigarro em estados vizinhos
*** Como utilizar pelo R

O =conjunto de dados= se encontra sob o pacote =Ecdat= (Econometrics
Datasets [Conjuntos de Econometria]). Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no 
  install.packages("Ecdat",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote.
#+begin_src ein-r :session localhost :results output :exports both :eval no
  load(Ecdat)
#+end_src

Finalmente, podemos acessar o =conjunto=.
#+begin_src ein-r :session localhost :results output :exports both :eval no
  cigarro <- data("Cigar")
  cigarro
#+end_src

*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o =conjunto= [[https://drive.google.com/file/d/1iOQFp0TshV8km2X13fRkXGm8kd-ZVfSL/view?usp=sharing][cigarro.csv ]]da seguinte maneira.

#+NAME: 7170bc6a-e3e4-48f9-b1c5-c8b92fec5612
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/cigarro.csv')
  head(data,5)
#+end_src

#+RESULTS: 7170bc6a-e3e4-48f9-b1c5-c8b92fec5612
:   state year price pop  pop16  cpi  ndi      sales pimin
: 1 1     63   28.6  3383 2236.5 30.6 1558.305 93.9  26.1 
: 2 1     64   29.8  3431 2276.7 31.0 1684.073 95.4  27.5 
: 3 1     65   29.8  3486 2327.5 31.5 1809.842 98.5  28.9 
: 4 1     66   31.5  3524 2369.7 32.4 1915.160 96.4  29.5 
: 5 1     67   31.6  3533 2393.7 33.4 2023.546 95.5  29.6 

** [[https://www.openintro.org/data/index.php?data=gifted][Inteligência de prodígios]]
+ *Modele o IQ da criança com as outras variáveis*
*** Sobre o =Conjunto=
+ Referências:
  - Graybill, F.A. & Iyer, H.K., (1994) Regression Analysis: Concepts and Applications, Duxbury, p. 511-6.
+ Dados:
  1. IQ da Criança.
  2. IQ Pai.
  3. IQ Mãe.
  4. Período em meses, até primeiras palavras.
  5. Período em meses, até quanto contou até dez.
  6. Tempo passado, pelos pais, lendo livros, semanalmente.
  7. Tempo passado assistindo programas educativos, semanalmente.
  8. Tempo assistindo desenhos (=cartoons=), semanalmente.
     
