tex/nota-conjdados-regressao.tex
% Created 2021-10-21 Thu 15:54
% Intended LaTeX compiler: xelatex
\documentclass[12pt]{abntex2}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\hypersetup{colorlinks, allcolors=.,
 colorlinks=true,
 linkcolor={blue!78!white},
 urlcolor={purple},
 filecolor={winered},
}
\usepackage{xcolor} % to access the named colour LightGray
\definecolor{LightGray}{gray}{0.2}
\usepackage{minted}
\usemintedstyle{monokai}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}
}
\begin{document}

\tableofcontents
\clearpage


\chapter{Análise de Regressão Linear Múltipla, Conjuntos de Dados}
\label{sec:org395f2a7}
\section{\href{https://www.kaggle.com/augustus0498/life-expectancy-who}{Expectativa de Vida por País}}
\label{sec:orgd4e053d}
\begin{itemize}
\item \textbf{Modelar a variável expectativa de vida}
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:orgfb4a40c}
\begin{itemize}
\item Dados de todos países, derivados da OMS.
\end{itemize}

\begin{itemize}
\item Dados:
\begin{itemize}
\item Country: país,
\item Year: ano correspondente aos dados,
\item Status: estado da industrialização,
\item Life expectancy: expectativa de vida,
\item Adult Mortality \(15<\text{idade}<60\): mortalidade adulta por mil habitantes,
\item Infant deaths: mortalidade infantil por mil habitantes,
\item Alcohol: uso de álcool por litro puro (+15 anos),
\item Percentage expenditure: gasto em saúde em percentagem do PIB per capta,
\item Hepatitis B: percentagem de imunização entre bebês com um ano,
\item Measles: quantidade de casos reportados de Rubeola por mil habitantes,
\item BMI: média de index de massa corpórea da população,
\item under-five deaths: quantidade de mortes antes dos cinco anos por mil habitantes,
\item Polio: quantidade de imunização entre bebês com um ano (percentagem),
\item Total expenditure: percentagem do gasto total do governo com saúde,
\item Diphtheria: percentagem de imunização de tétano (\(\leq 1 \text{ano}\)),
\item HIV/AIDS: morte a cada mil nascimentos (contanto nascimento de 0-4 anos de idade),
\item GDP: PIB em dólares,
\item Population: População,
\item thinness  1-19 years: prevalescência de pessoas magras (1-19 anos de idade),
\item thinness 5-9 years: prevalescência de pessoas magras (5-9 anos de idade),
\item Income composition of resources: IDH (qualidade de vida) em termos de composição por salário pessoal (provida por salário próprio),
\item Schooling: média do número de anos sendo educado (escolaridade).
\end{itemize}
\end{itemize}

\subsection{Como utilizar o conjunto (cópia de arquivo CSV, localmente)}
\label{sec:orge5233e5}
O \texttt{conjunto} apenas está disponível por meio da \href{https://drive.google.com/file/d/1nUnOwgAcWIqoyG0P5\_wnlh1wPxxSUqv5/view?usp=sharing}{cópia da núvem}, para o
computador local. Após baixar o arquivo \texttt{Life\_Expectancy\_Data.csv},
para seu computador, a análise deve ser feita, em relação a um
determinado ano, a qual foi indicado ao grupo.

Por exemplo, para a análise da expectativa de vida, para o ano de
2015, seria feita invocando os dados da seguinte maneira,

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
life <- read.csv('./data/csv/Life_Expectancy_Data.csv')
life_2015 <- subset(life, Year=="2015")
life_2015[1:6,1:5] 
\end{minted}

\begin{verbatim}
   Country             Year Status     Life.expectancy Adult.Mortality
1  Afghanistan         2015 Developing 65.0            263            
17 Albania             2015 Developing 77.8             74            
33 Algeria             2015 Developing 75.6             19            
49 Angola              2015 Developing 52.4            335            
65 Antigua and Barbuda 2015 Developing 76.4             13            
81 Argentina           2015 Developing 76.3            116            
\end{verbatim}


Obs: apenas 5 colunas foram selecionadas, por motivos estéticos na formatação.

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-plm-cigar}{Consumo de Cigarro}}
\label{sec:org0d4e8c3}
\begin{itemize}
\item \textbf{Modelar quantidade de venda (sales)}.
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:orgc64d986}
\begin{itemize}
\item Usado em:
\begin{itemize}
\item Baltagi, Badi H. (2001) Econometric Analysis of Panel Data, 2nd ed., John Wiley and Sons.
\item Baltagi, Badi H. (2013) Econometric Analysis of Panel Data, 5th ed., John Wiley and Sons.
\item Baltagi, B.H. and D. Levin (1992) “Cigarette taxation: raising revenues and reducing consumption”, Structural Changes and Economic Dynamics, 3(2), pp. 321–335.
\item Baltagi, B.H., J.M. Griffin and W. Xiong (2000) “To pool or not to pool: homogeneous versus heterogeneous estimators applied to cigarette demand”, Review of Economics and Statistics, 82(1), pp. 117–126.
\end{itemize}
\item Dados: anos 1963-1992
\begin{itemize}
\item State: estados norte americanos, \(\{1,2,3, \ldots, 51\}\).
\item Year: Anos 63-92.
\item Price: preço do maço.
\item Pop: população de fumantes.
\item Pop16: população acima de 16.
\item CPI: índice do preço (ideal) dado pelo consumidor.
\item NDI: Salário líquido per capta.
\item Sales: venda de cigarro por maço.
\item Pimin: preço mínimo de cigarro em estados vizinhos
\end{itemize}
\end{itemize}
\subsection{Como utilizar pelo R}
\label{sec:org6e2eb10}

O \texttt{conjunto de dados} se encontra sob o pacote \texttt{Ecdat} (Econometrics
Datasets [Conjuntos de Econometria]). Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("Ecdat",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote.
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
load(Ecdat)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto}.
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
cigarro <- data("Cigar")
cigarro
\end{minted}

\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org458a125}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o \texttt{conjunto} \href{https://drive.google.com/file/d/1iOQFp0TshV8km2X13fRkXGm8kd-ZVfSL/view?usp=sharing}{cigarro.csv }da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
  data <- read.csv('./data/csv/cigarro.csv')
  cigarro<- subset(data, year==90)
  head(data,5)
\end{minted}

\begin{verbatim}
    state year price pop     pop16   cpi   ndi   sales pimin
28  1     90   139.1  4129.2  3148.6 130.7 12806 108.6 132.3
58  3     90   130.2  3598.2  2703.7 130.7 13826  88.9 133.6
88  4     90   141.2  2411.1  1834.9 130.7 12370 113.1 129.1
118 5     90   163.8 29602.1 22490.6 130.7 17384  77.8 130.2
148 7     90   171.2  3242.9  2567.1 130.7 21447  91.5 150.9
\end{verbatim}

\section{\href{https://www.openintro.org/data/index.php?data=gifted}{Inteligência de prodígios}}
\label{sec:org99eddfe}
\begin{itemize}
\item \textbf{Modele o IQ da criança com as outras variáveis}
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:org325f960}
\begin{itemize}
\item Referências:
\begin{itemize}
\item Graybill, F.A. \& Iyer, H.K., (1994) Regression Analysis: Concepts and Applications, Duxbury, p. 511-6.
\end{itemize}
\item Dados:
\begin{enumerate}
\item IQ da Criança.
\item IQ Pai.
\item IQ Mãe.
\item Período em meses, até primeiras palavras.
\item Período em meses, até quanto contou até dez.
\item Tempo passado, pelos pais, lendo livros, semanalmente.
\item Tempo passado assistindo programas educativos, semanalmente.
\item Tempo assistindo desenhos (\texttt{cartoons}), semanalmente.
\end{enumerate}
\end{itemize}
