nota-conjdados-regressao.org
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o =conjunto= [[https://drive.google.com/file/d/1stukrpc_Rqu-nlYZu_-BFHNZec676_BR/view?usp=sharing][gifted.csv]] da seguinte maneira.

#+NAME: 2d27946d-47bf-49a7-9412-c31c12858425
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/gifted.csv')
  head(data,5)
#+end_src

#+RESULTS: 2d27946d-47bf-49a7-9412-c31c12858425
:   score fatheriq motheriq speak count read edutv cartoons
: 1 159   115      117      18    26    1.9  3.00  2.00    
: 2 164   117      113      20    37    2.5  1.75  3.25    
: 3 154   115      118      20    32    2.2  2.75  2.50    
: 4 157   113      131      12    24    1.7  2.75  2.25    
: 5 156   110      109      17    34    2.2  2.25  2.50    

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-mosaicdata-sat][SAT - Professores]]
+ *Modelar variável SAT (nota geral)*
*** Sobre o =Conjunto=
+ Dados:
  - State: estado norte americano
  - Expend: termo médio de aula assistida diária.
  - Ratio: razão de alunos por professor.
  - Salary: salário do professor médio, anual.
  - Frac: percentagem de alunos elegíveis a participar do SAT.
  - Verbal: nota pra proficiência verbal no SAT.
  - Math: nota para proficiência em exatadas no SAT.
  - SAT: nota geral do SAT final.

*** Como utilizar pelo R

O =conjunto de dados= se encontra sob o pacote =mosaicData=. Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no 
  install.packages("mosaicData",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote,
#+begin_src ein-r :session localhost :results output :exports both :eval no
  library(mosaicData)
#+end_src

Finalmente, podemos acessar o =conjunto=,
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- SAT
  head(data)
#+end_src

*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1E6aOdH1nf0qF4Lky131iX1LNBjaIYAev/view?usp=sharing][professores-SAT]] da seguinte maneira.

#+NAME: a845d1e5-4aed-4e7f-a796-af7d9d94ebf7
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/professores-SAT.csv')
  head(data,5)
#+end_src

#+RESULTS: a845d1e5-4aed-4e7f-a796-af7d9d94ebf7
:   state      expend ratio salary frac verbal math sat 
: 1 Alabama    4.405  17.2  31.144  8   491    538  1029
: 2 Alaska     8.963  17.6  47.951 47   445    489   934
: 3 Arizona    4.778  19.3  32.175 27   448    496   944
: 4 Arkansas   4.459  17.1  28.934  6   482    523  1005
: 5 California 4.992  24.0  41.078 45   417    485   902

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-robustbase-toxicity][Toxicidade]]
+ *Modelar nível de toxicidade aquática de ácidos caboxílicos, baseado nos outros descritores moleculares.*
*** Sobre o =Conjunto=
  + Dados:
    - toxicity
    toxicidade  aquática, definida como o $log(\textrm{IGC50}^{-1})$; tipicamente, a "reposta".
    - logKow
      log Kow, coeficiente de parcionamento
    - pKa
      pKa: constante dissociativa
    - ELUMO
      Energia do menor orbital molecular ocupado  
    - Ecarb
      Estado eletrotopolófico do grupo carboxílico
    - Emet
      Estado eletrotopolófico do grupo metil
    - RM
      Reflectibilidade Molar
    - IR
      Index de Refração
    - Ts
      Tensão superficial
    - P
      Polaridade
*** Como utilizar pelo R
O =conjunto de dados= se encontra sob o pacote =robustbase=. Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no
  install.packages("robustbase",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote,
#+begin_src ein-r :session localhost :results output :exports both :eval no
 library(robustbase)
#+end_src

Finalmente, podemos acessar o =conjunto=,
#+begin_src ein-r :session localhost :results output :exports both :eval no 
  data <- toxicity
  head(data)
#+end_src
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1dZE0wj0Z-FeXCvz-4ft0CPJ6Enn1fnew/view?usp=sharing][toxicidade]] da seguinte maneira.

#+NAME: 4b8434c2-dba8-4ac3-ab88-d60c05b376cd
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/toxicity.csv')
  head(data,5)
#+end_src

#+RESULTS: 4b8434c2-dba8-4ac3-ab88-d60c05b376cd
:   toxicity logKow pKa  ELUMO Ecarb   Emet   RM    IR    Ts   P    
: 1 -0.15    1.68   1.00 4.81  17.8635 1.4838 31.36 1.425 31.3 12.43
: 2 -0.33    0.94   0.98 4.68  16.9491 0.0000 22.10 1.408 30.4  8.76
: 3 -0.34    1.16   0.96 4.86  17.1806 0.2778 26.73 1.418 30.9 10.59
: 4  0.03    2.75   1.00 4.83  18.4794 3.5836 40.63 1.435 31.8 16.10
: 5 -0.57    0.79   0.97 4.80  16.8022 1.0232 22.14 1.411 32.5  8.77

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-stat2data-fertility][Fertilidade Feminina]]
+ *Modelar MeanAFC* o qual diretamente empacta a habilidade de ter filhos.
*** Sobre o =Conjunto=
  + Dados:
    - Idade
    - LowAFC: Conta da menor quantidade de folículos antrais.
    - MeanAFC: Média de folículos antrais.
    - FSH: Máxima quantidade de níveis de hormônios estimulantes aos folículos.
    - E2: Nível de fertilidade.
    - MaxE2: Máximo nível de fertilidade.
    - MaxDailyGn: Nível máximo de gonadotrofina.
    - TotalGn: Nível total de gonadotrofina.
    - Oocytes: Quantidade de ovócitos/oócitos.
    - Embryos: Quantidade de embriões.
*** Como utilizar pelo R
O =conjunto de dados= se encontra sob o pacote =Stat2Data=. Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no
  install.packages("Stat2Data",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote,
#+begin_src ein-r :session localhost :results output :exports both :eval no
 library(Stat2Data)
#+end_src

Finalmente, podemos acessar o =conjunto=,
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- data("Fertility")
  head(data)
#+end_src
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1iG15B5sUrntNJCjpIXT7Li1IHOlpvSKc/view?usp=sharing][Fertilidade]] da seguinte maneira.

#+NAME: 932d9866-8ab0-44ce-8398-8278ec6c6d10
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/Fertility.csv')
  head(data,5)
#+end_src

#+RESULTS: 932d9866-8ab0-44ce-8398-8278ec6c6d10
:   Age LowAFC MeanAFC FSH E2 MaxE2 MaxDailyGn TotalGn Oocytes Embryos
: 1 40  40     51.5    5.3 45 1427  300        2700    25      13     
: 2 37  41     41.0    7.1 53  802  225        1800     7       6     
: 3 40  38     41.0    4.9 40 4533  450        4850    27      15     
: 4 40  36     37.5    3.9 26 1804  300        2700     9       4     
: 5 30  36     36.0    4.0 49 2526  150        1500    19      12     

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-datasets-attitude][Atitudes em relação à empresa]]
+ *Modelar e modelar o rating*
