tex/nota-conjdados-regressao.tex

\subsection{Invocação de conjuto, por arquivo local}
\label{sec:orgdc56965}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o \texttt{conjunto} \href{https://drive.google.com/file/d/1stukrpc\_Rqu-nlYZu\_-BFHNZec676\_BR/view?usp=sharing}{gifted.csv} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/gifted.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  score fatheriq motheriq speak count read edutv cartoons
1 159   115      117      18    26    1.9  3.00  2.00    
2 164   117      113      20    37    2.5  1.75  3.25    
3 154   115      118      20    32    2.2  2.75  2.50    
4 157   113      131      12    24    1.7  2.75  2.25    
5 156   110      109      17    34    2.2  2.25  2.50    
\end{verbatim}

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-mosaicdata-sat}{SAT - Professores}}
\label{sec:org7add5d8}
\begin{itemize}
\item \textbf{Modelar variável SAT (nota geral)}
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:org35a3fdd}
\begin{itemize}
\item Dados:
\begin{itemize}
\item State: estado norte americano
\item Expend: termo médio de aula assistida diária.
\item Ratio: razão de alunos por professor.
\item Salary: salário do professor médio, anual.
\item Frac: percentagem de alunos elegíveis a participar do SAT.
\item Verbal: nota pra proficiência verbal no SAT.
\item Math: nota para proficiência em exatadas no SAT.
\item SAT: nota geral do SAT final.
\end{itemize}
\end{itemize}

\subsection{Como utilizar pelo R}
\label{sec:orge4ae9b7}

O \texttt{conjunto de dados} se encontra sob o pacote \texttt{mosaicData}. Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("mosaicData",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
library(mosaicData)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto},
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- SAT
head(data)
\end{minted}

\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org915e2ad}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1E6aOdH1nf0qF4Lky131iX1LNBjaIYAev/view?usp=sharing}{professores-SAT} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/professores-SAT.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  state      expend ratio salary frac verbal math sat 
1 Alabama    4.405  17.2  31.144  8   491    538  1029
2 Alaska     8.963  17.6  47.951 47   445    489   934
3 Arizona    4.778  19.3  32.175 27   448    496   944
4 Arkansas   4.459  17.1  28.934  6   482    523  1005
5 California 4.992  24.0  41.078 45   417    485   902
\end{verbatim}

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-robustbase-toxicity}{Toxicidade}}
\label{sec:org40e4d0c}
\begin{itemize}
\item \textbf{Modelar nível de toxicidade aquática de ácidos caboxílicos, baseado nos outros descritores moleculares.}
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:org48b5e0e}
\begin{itemize}
\item Dados:
\begin{itemize}
\item toxicity
\end{itemize}
toxicidade  aquática, definida como o \(log(\textrm{IGC50}^{-1})\); tipicamente, a "reposta".
\begin{itemize}
\item logKow
log Kow, coeficiente de parcionamento
\item pKa
pKa: constante dissociativa
\item ELUMO
Energia do menor orbital molecular ocupado
\item Ecarb
Estado eletrotopolófico do grupo carboxílico
\item Emet
Estado eletrotopolófico do grupo metil
\item RM
Reflectibilidade Molar
\item IR
Index de Refração
\item Ts
Tensão superficial
\item P
Polaridade
\end{itemize}
\end{itemize}
\subsection{Como utilizar pelo R}
\label{sec:orgdd2a536}
O \texttt{conjunto de dados} se encontra sob o pacote \texttt{robustbase}. Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("robustbase",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
library(robustbase)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto},
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- toxicity
head(data)
\end{minted}
\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org8df62c1}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1dZE0wj0Z-FeXCvz-4ft0CPJ6Enn1fnew/view?usp=sharing}{toxicidade} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/toxicity.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  toxicity logKow pKa  ELUMO Ecarb   Emet   RM    IR    Ts   P    
1 -0.15    1.68   1.00 4.81  17.8635 1.4838 31.36 1.425 31.3 12.43
2 -0.33    0.94   0.98 4.68  16.9491 0.0000 22.10 1.408 30.4  8.76
3 -0.34    1.16   0.96 4.86  17.1806 0.2778 26.73 1.418 30.9 10.59
4  0.03    2.75   1.00 4.83  18.4794 3.5836 40.63 1.435 31.8 16.10
5 -0.57    0.79   0.97 4.80  16.8022 1.0232 22.14 1.411 32.5  8.77
\end{verbatim}

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-stat2data-fertility}{Fertilidade Feminina}}
\label{sec:org24d7a94}
\begin{itemize}
\item \textbf{Modelar MeanAFC} o qual diretamente empacta a habilidade de ter filhos.
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:orgfaec0e1}
\begin{itemize}
\item Dados:
\begin{itemize}
\item Idade
\item LowAFC: Conta da menor quantidade de folículos antrais.
\item MeanAFC: Média de folículos antrais.
\item FSH: Máxima quantidade de níveis de hormônios estimulantes aos folículos.
\item E2: Nível de fertilidade.
\item MaxE2: Máximo nível de fertilidade.
\item MaxDailyGn: Nível máximo de gonadotrofina.
\item TotalGn: Nível total de gonadotrofina.
\item Oocytes: Quantidade de ovócitos/oócitos.
\item Embryos: Quantidade de embriões.
\end{itemize}
\end{itemize}
\subsection{Como utilizar pelo R}
\label{sec:org4ba49af}
O \texttt{conjunto de dados} se encontra sob o pacote \texttt{Stat2Data}. Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("Stat2Data",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
library(Stat2Data)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto},
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- data("Fertility")
head(data)
\end{minted}
\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org44743c6}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1iG15B5sUrntNJCjpIXT7Li1IHOlpvSKc/view?usp=sharing}{Fertilidade} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/Fertility.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  Age LowAFC MeanAFC FSH E2 MaxE2 MaxDailyGn TotalGn Oocytes Embryos
1 40  40     51.5    5.3 45 1427  300        2700    25      13     
2 37  41     41.0    7.1 53  802  225        1800     7       6     
3 40  38     41.0    4.9 40 4533  450        4850    27      15     
4 40  36     37.5    3.9 26 1804  300        2700     9       4     
5 30  36     36.0    4.0 49 2526  150        1500    19      12     
\end{verbatim}

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-datasets-attitude}{Atitudes em relação à empresa}}
\label{sec:orgfea1fe2}
\begin{itemize}
\item \textbf{Modelar e modelar o rating}
\end{itemize}
