nota-conjdados-regressao.org
*** Sobre o =Conjunto=
  + Dados: (em percentagem)
    - Complaints: percentagem de resoluções de reclamações.
    - Privileges: percentagem de intolerância de privilégios.
    - Learning: percentagem de oportunidade de aprendizado.
    - Raises: percetagem de aumento correspondente à perfôrmance.
    - Critical: percentagem de atitudes e críticas exacerbadas.
    - Advancel: percentadem de evolução percebida da empresa e posto.
    - Rating: avaliação geral positiva da empresa
      
*** Como utilizar pelo R
O =conjunto de dados= se encontra sob o pacote =datasets=. Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no 
  install.packages("datasets",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote,
#+begin_src ein-r :session localhost :results output :exports both :eval no 
 library(datasets)
#+end_src

Finalmente, podemos acessar o =conjunto=,
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- data("attitude")
  head(data)
#+end_src
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1rKj4NPD61bWKD6HBC4fux2Eit6CNEKwr/view?usp=sharing][Atitude]] da seguinte maneira.

#+NAME: 589027ab-8c61-4626-b868-598b449a1512
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/attitude.csv')
  head(data,5)
#+end_src

#+RESULTS: 589027ab-8c61-4626-b868-598b449a1512
:   rating complaints privileges learning raises critical advance
: 1 43     51         30         39       61     92       45     
: 2 63     64         51         54       63     73       47     
: 3 71     70         68         69       76     86       48     
: 4 61     63         45         47       54     84       35     
: 5 81     78         56         66       71     83       47     

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-datasets-lifecyclesavings][Hipótese de ciclos-de-economia salarial]]
+ *Modelar =sr=, a partir das outra variáveis*
+ Hipótese formulada por Franco Modigliani 1960-1970, de que essas (outras)
  variáveis eram explicativas do fenômeno 'sr'.
*** Sobre o =Conjunto=
  + Dados:
    - Sr: valor agregado à economia particular (razão entre valor total de economias pessoais e salário líquido)
    - Pop15: população sob quinze anos de idade.
    - Pop75: população acima de setenta e cinco anos de idade.
    - dpi: valor de salário líquido per-capita médio.
    - ddpi: taxa de crescimento de dpi.

*** Como utilizar pelo R
O =conjunto de dados= se encontra sob o pacote =datasets=. Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no
  install.packages("datasets",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote,
#+begin_src ein-r :session localhost :results output :exports both :eval no
 library(datasets)
#+end_src

Finalmente, podemos acessar o =conjunto=,
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- data("LifeCycleSavings")
  head(data)
#+end_src
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1j2K7J1rb3V2Qr_t0rcBhA6tyuqh88AjY/view?usp=sharing][savings.csv]] da seguinte maneira.

#+NAME: 4257fa63-5cc2-4ad2-a160-08a764a6ff60
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/savings.csv')
  head(data,5)
#+end_src

#+RESULTS: 4257fa63-5cc2-4ad2-a160-08a764a6ff60
:           sr    pop15 pop75 dpi     ddpi
: Australia 11.43 29.35 2.87  2329.68 2.87
: Austria   12.07 23.32 4.41  1507.99 3.93
: Belgium   13.17 23.80 4.43  2108.47 3.82
: Bolivia    5.75 41.89 1.67   189.13 0.22
: Brazil    12.88 42.19 0.83   728.47 4.56

** [[https://r-data.pmagunia.com/dataset/r-dataset-package-ecdat-computers][Preço de Computadores 1993-1995]]
+ *Modelar preço (=price=) a partir das variáveis*.
*** Dados sobre o =Conjunto=
  + Dados:
    - Speed: velocidade de rotação em MHz do processador (clock speed)
    - HD: tamanho da memória do disco rígido em MB
    - RAM: tamanho da RAM em MB
    - Screen: tamanho da tela em polegadas
    - CD: tem ou não entrada para CDs.
    - Multi: kit multimídia incluso ou não (caixa de som etc).
    - Premium: manufatura feita por compania conhecida (IBM etc).
    - Ads: quantidade de anúncio do computador por mês.
    - Trend: quanto tempo está no mercado.
*** Como utilizar pelo R
O =conjunto de dados= se encontra sob o pacote =Ecdat=. Desta forma, precisamos
instalá-lo.

#+begin_src ein-r :session localhost :results output :exports both :eval no
  install.packages("Ecdat",mirror="https://vps.fmvz.usp.br/CRAN/")
#+end_src

Após instalação, precisamos invocar o pacote,
#+begin_src ein-r :session localhost :results output :exports both :eval no
 library(Ecdat)
#+end_src

Finalmente, podemos acessar o =conjunto=,
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- data("Computers")
  head(data)
#+end_src

*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1C1-9aM-dYzx7UQrWq_gg4DRw6wtj-l7Z/view?usp=sharing][computers.csv]] da seguinte maneira.

#+NAME: 3b2dccc6-fe15-4d72-9867-5883cc33e356
#+begin_src ein-r :session localhost :results output :exports both :eval no
  data <- read.csv('./data/csv/computers.csv')
  head(data,5)
#+end_src

#+RESULTS: 3b2dccc6-fe15-4d72-9867-5883cc33e356
:   price speed hd  ram screen cd multi premium ads trend
: 1 1499  25     80  4  14     no no    yes     94  1    
: 2 1795  33     85  2  14     no no    yes     94  1    
: 3 1595  25    170  4  15     no no    yes     94  1    
: 4 1849  25    170  8  14     no no    no      94  1    
: 5 3295  33    340 16  14     no no    yes     94  1    


** [[https://www.sheffield.ac.uk/mash/statistics/datasets][Peso ao Nascimento]]  
+ *Modelar peso ao nascimento (libras) (=Birthweight=) a partir das variáveis*.
*** Dados sobre o =Conjunto=
 + Dados:
   - lowbwt: baixo peso ao nascer. 
   - ID: Identificador
   - mage35: mãe mais velha do que 35 anos.
   - fnocig: número de cigarros fumado pelo pai diariamente.
   - fheight: peso do pai (kg)
   - fedyrs: quantidade de anos de educação do pai
   - fage: idade do pai
   - mppwt: peso da mãe pré gravidez.
   - mheight: tamanho da mãe (cm).
   - mnocig: número de cigarros fumados diariamente pela mãe.
   - Motherage: idade da mãe.
   - Gestation Smoker: fumante durante gestação 
   - headcirumfer: circunferência da cabeça
   - length: tamanho (cm)
