tex/nota-conjdados-regressao.tex
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:org29595b6}
\begin{itemize}
\item Dados: (em percentagem)
\begin{itemize}
\item Complaints: percentagem de resoluções de reclamações.
\item Privileges: percentagem de intolerância de privilégios.
\item Learning: percentagem de oportunidade de aprendizado.
\item Raises: percetagem de aumento correspondente à perfôrmance.
\item Critical: percentagem de atitudes e críticas exacerbadas.
\item Advancel: percentadem de evolução percebida da empresa e posto.
\item Rating: avaliação geral positiva da empresa
\end{itemize}
\end{itemize}

\subsection{Como utilizar pelo R}
\label{sec:orgcfe5e00}
O \texttt{conjunto de dados} se encontra sob o pacote \texttt{datasets}. Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("datasets",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
library(datasets)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto},
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- data("attitude")
head(data)
\end{minted}
\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org2caac3c}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1rKj4NPD61bWKD6HBC4fux2Eit6CNEKwr/view?usp=sharing}{Atitude} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/attitude.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  rating complaints privileges learning raises critical advance
1 43     51         30         39       61     92       45     
2 63     64         51         54       63     73       47     
3 71     70         68         69       76     86       48     
4 61     63         45         47       54     84       35     
5 81     78         56         66       71     83       47     
\end{verbatim}

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-datasets-lifecyclesavings}{Hipótese de ciclos-de-economia salarial}}
\label{sec:orgf57994f}
\begin{itemize}
\item \textbf{Modelar \texttt{sr}, a partir das outra variáveis}
\item Hipótese formulada por Franco Modigliani 1960-1970, de que essas (outras)
variáveis eram explicativas do fenômeno 'sr'.
\end{itemize}
\subsection{Sobre o \texttt{Conjunto}}
\label{sec:orgd4e28b7}
\begin{itemize}
\item Dados:
\begin{itemize}
\item Sr: valor agregado à economia particular (razão entre valor total de economias pessoais e salário líquido)
\item Pop15: população sob quinze anos de idade.
\item Pop75: população acima de setenta e cinco anos de idade.
\item dpi: valor de salário líquido per-capita médio.
\item ddpi: taxa de crescimento de dpi.
\end{itemize}
\end{itemize}

\subsection{Como utilizar pelo R}
\label{sec:org0dc5e41}
O \texttt{conjunto de dados} se encontra sob o pacote \texttt{datasets}. Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("datasets",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
library(datasets)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto},
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- data("LifeCycleSavings")
head(data)
\end{minted}
\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org2896cb9}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1j2K7J1rb3V2Qr\_t0rcBhA6tyuqh88AjY/view?usp=sharing}{savings.csv} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/savings.csv')
head(data,5)
\end{minted}

\begin{verbatim}
          sr    pop15 pop75 dpi     ddpi
Australia 11.43 29.35 2.87  2329.68 2.87
Austria   12.07 23.32 4.41  1507.99 3.93
Belgium   13.17 23.80 4.43  2108.47 3.82
Bolivia    5.75 41.89 1.67   189.13 0.22
Brazil    12.88 42.19 0.83   728.47 4.56
\end{verbatim}

\section{\href{https://r-data.pmagunia.com/dataset/r-dataset-package-ecdat-computers}{Preço de Computadores 1993-1995}}
\label{sec:orgde96e65}
\begin{itemize}
\item \textbf{Modelar preço (\texttt{price}) a partir das variáveis}.
\end{itemize}
\subsection{Dados sobre o \texttt{Conjunto}}
\label{sec:org5b0fc5a}
\begin{itemize}
\item Dados:
\begin{itemize}
\item Speed: velocidade de rotação em MHz do processador (clock speed)
\item HD: tamanho da memória do disco rígido em MB
\item RAM: tamanho da RAM em MB
\item Screen: tamanho da tela em polegadas
\item CD: tem ou não entrada para CDs.
\item Multi: kit multimídia incluso ou não (caixa de som etc).
\item Premium: manufatura feita por compania conhecida (IBM etc).
\item Ads: quantidade de anúncio do computador por mês.
\item Trend: quanto tempo está no mercado.
\end{itemize}
\end{itemize}
\subsection{Como utilizar pelo R}
\label{sec:orgbd1fec3}
O \texttt{conjunto de dados} se encontra sob o pacote \texttt{Ecdat}. Desta forma, precisamos
instalá-lo.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
install.packages("Ecdat",mirror="https://vps.fmvz.usp.br/CRAN/")
\end{minted}

Após instalação, precisamos invocar o pacote,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
library(Ecdat)
\end{minted}

Finalmente, podemos acessar o \texttt{conjunto},
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- data("Computers")
head(data)
\end{minted}

\subsection{Invocação de conjuto, por arquivo local}
\label{sec:orgffce1ec}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1C1-9aM-dYzx7UQrWq\_gg4DRw6wtj-l7Z/view?usp=sharing}{computers.csv} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/computers.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  price speed hd  ram screen cd multi premium ads trend
1 1499  25     80  4  14     no no    yes     94  1    
2 1795  33     85  2  14     no no    yes     94  1    
3 1595  25    170  4  15     no no    yes     94  1    
4 1849  25    170  8  14     no no    no      94  1    
5 3295  33    340 16  14     no no    yes     94  1    
\end{verbatim}


\section{\href{https://www.sheffield.ac.uk/mash/statistics/datasets}{Peso ao Nascimento}}
\label{sec:org2845403}
\begin{itemize}
\item \textbf{Modelar peso ao nascimento (libras) (\texttt{Birthweight}) a partir das variáveis}.
\end{itemize}
\subsection{Dados sobre o \texttt{Conjunto}}
\label{sec:orga4d228d}
\begin{itemize}
\item Dados:
\begin{itemize}
\item lowbwt: baixo peso ao nascer.
\item ID: Identificador
\item mage35: mãe mais velha do que 35 anos.
\item fnocig: número de cigarros fumado pelo pai diariamente.
\item fheight: peso do pai (kg)
\item fedyrs: quantidade de anos de educação do pai
\item fage: idade do pai
\item mppwt: peso da mãe pré gravidez.
\item mheight: tamanho da mãe (cm).
\item mnocig: número de cigarros fumados diariamente pela mãe.
\item Motherage: idade da mãe.
\item Gestation Smoker: fumante durante gestação
\item headcirumfer: circunferência da cabeça
\item length: tamanho (cm)
\end{itemize}
\end{itemize}
