nota-conjdados-regressao.org
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1xv2lCPsj04FjGPQ_BgPS9mrTIjBcyHQk/view?usp=sharing][Birth Weight]] da seguinte maneira.

#+NAME: 457c1318-b690-4974-9451-4c0f5901dac7
#+begin_src ein-r :session localhost :results output :exports both :eval no 
  data <- read.csv('./data/csv/Birthweight_reduced_kg_R.csv')
  head(data,5)
#+end_src

#+RESULTS: 457c1318-b690-4974-9451-4c0f5901dac7
#+begin_example
  X...ID Length Birthweight Headcirc Gestation smoker mage mnocig mheight mppwt
1 1360   56     4.55        34       44        0      20   0      162     57   
2 1016   53     4.32        36       40        0      19   0      171     62   
3  462   58     4.10        39       41        0      35   0      172     58   
4 1187   53     4.07        38       44        0      20   0      174     68   
5  553   54     3.94        37       42        0      24   0      175     66   
  fage fedyrs fnocig fheight lowbwt mage35
1 23   10     35     179     0      0     
2 19   12      0     183     0      0     
3 31   16     25     185     0      1     
4 26   14     25     189     0      0     
5 30   12      0     184     0      0     
#+end_example

** [[https://www.sheffield.ac.uk/mash/statistics/datasets][Crime]]  
+ *Modelar taxa de crime (=CrimeRate=) a partir das variáveis*.
*** Dados sobre o =Conjunto=
+ Dados:
  - CrimeRate: Taxa de criminalidade (ofensas por milhão de habitantes). 
  - Youth: Jovens entre 18-24 anos a cada mil habitantes. 
  - Southern: Estado do sul? 
  - Education: Tempo de educação (anos de estudo até 25) 
  - ExpenditureYear0: Dinheiro para segurança pública per capta.
  - LabourForce: Quantidade de jovens trabalhadores por 1000 habitantes.
  - Males: Homens (por cada 1000 mulheres).
  - MoreMales: Mais homens que mulheres?.
  - StateSize: Tamanho do estado em milhares.
  - YouthUnemployment: Desemprego de jovens por mil.
  - BelowWage: Número de famílias abaixo de meio salário por mil.
  - Wage: Salário médio semanal.
  - MatureUnemployment: Desemprego de sêniors (35-39) por mil.

*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto [[https://drive.google.com/file/d/1hZpHoEXbhZGvmtmrbcWpXYfBV-2ZD7uF/view?usp=sharing][Crimes]] da seguinte maneira.

#+NAME: 86bf43f6-694e-4630-9acc-0a11c246b4de
#+begin_src ein-r :session localhost :results output :exports both :eval no 
  data <- read.csv('./data/csv/Crime_R.csv')
  head(data,5)
#+end_src

#+RESULTS: 86bf43f6-694e-4630-9acc-0a11c246b4de
#+begin_example
  X...CrimeRate Youth Southern Education ExpenditureYear0 LabourForce Males
1 45.5          135   0        12.4       69              540          965 
2 52.3          140   0        10.9       55              535         1045 
3 56.6          157   1        11.2       47              512          962 
4 60.3          139   1        11.9       46              480          968 
5 64.2          126   0        12.2      106              599          989 
  MoreMales StateSize YouthUnemployment ... ExpenditureYear10 LabourForce10
1 0          6         80               ... 71                564          
2 1          6        135               ... 54                540          
3 0         22         97               ... 44                529          
4 0         19        135               ... 41                497          
5 0         40         78               ... 97                602          
  Males10 MoreMales10 StateSize10 YouthUnemploy10 MatureUnemploy10
1  974    0            6           82             20              
2 1039    1            7          138             39              
3  959    0           24           98             33              
4  983    0           20          131             50              
5  989    0           42           79             24              
  HighYouthUnemploy10 Wage10 BelowWage10
1 1                   632    142        
2 1                   521    210        
3 0                   359    256        
4 0                   510    235        
5 1                   660    162        
#+end_example

** [[https://archive.ics.uci.edu/ml/datasets/Student+Performance#][Performance de Estudantes]]  
+ *Modelar nota final (=G3=) a partir das variáveis*.
*** Dados sobre o =Conjunto=
+ Dados:
  - school - Escola em que estuda (binary: 'GP' - Gabriel Pereira ou 'MS' - Mousinho da Silveira)
  - sex - Sexo (binary: 'F' - mulher ou 'M' - homem)
  - age - Idade (numeric: from 15 to 22)
  - address - Estadia/tipo da região (binary: 'U' - urbana or 'R' - rural)
  - famsize - Tamanho familhar (binary: 'LE3' - menos que  3 or 'GT3' - mais que 3)
  - Pstatus - Estado de co-habitação dos pais (binary: 'T' - junto or 'A' - aparte)
  - Medu - Educação da mãe (numeric: 0 - nenhuma, 1 - primária (4th ano), 2 - 5th ao 9th ano, 3 - secundária, ou 4 - superior)
  - Fedu - Educação do pai (numeric: 0 - nenhuma, 1 - primária (4th ano), 2 - 5th ao 9th ano, 3 - secundária, ou 4 - superior)
  - Mjob - Tabalho da mãe (nominal: 'teacher', 'health' care related, civil 'services' (e.g. administrative or police), 'at_home' or 'other')
  - Fjob - Trabalho do pai (nominal: 'teacher', 'health' care related, civil 'services' (e.g. administrative or police), 'at_home' or 'other')
  - reason - Razão de escolha da escola (nominal: close to 'home', school 'reputation', 'course' preference or 'other')
  - guardian - Guardião legal (nominal: 'mother', 'father' or 'other')
  - traveltime - Tempo de viagem, escola à casa (numeric: 1 - <15 min., 2 - 15 to 30 min., 3 - 30 min. to 1 hour, or 4 - >1 hour)
  - studytime - Tempo de estudo semanal (numeric: 1 - <2 hours, 2 - 2 to 5 hours, 3 - 5 to 10 hours, or 4 - >10 hours)
  - failures - Número de reprovações (numeric: n if 1<=n<3, else 4)
  - schoolsup - Suporte educacional extra (binary: yes or no)
  - famsup - Suporte educacional familiar (binary: yes or no)
  - paid - Classes extras pagas (Math or Portuguese) (binary: yes or no)
  - activities - Atividades extra-curriculares (binary: yes or no)
  - nursery - Atendeu a clases de enfermaria (binary: yes or no)
  - higher - Quer seguir educação superior (binary: yes or no)
  - internet - Acesso a internet (binary: yes or no)
  - romantic - Em relação romántica (binary: yes or no)
  - famrel - Qualidade de relação familiar (numeric: from 1 - very bad to 5 - excellent)
  - freetime - Tempo livre fora da escola (numeric: from 1 - very low to 5 - very high)
  - goout - Tempo gasto saindo com amigos (numeric: from 1 - very low to 5 - very high)
  - Dalc - Consumo diário de álcool (numeric: from 1 - very low to 5 - very high)
  - Walc - Consumo em finais de semana de alcool (numeric: from 1 - very low to 5 - very high)
  - health - Estado de saúde atual (numeric: from 1 - very bad to 5 - very good)
  - absences - Número de faltas (numeric: from 0 to 93)
  - G1 - Notas primeiro período (numeric: from 0 to 20) [relacionadas com português ou matemática]
  - G2 - Nota segundo período (numeric: from 0 to 20) [relacionadas com português ou matemática]
# these grades are related with the course subject, Math or Portuguese:
- G3 - Nota final (numeric: from 0 to 20, output target) [relacionadas com português ou matemática]
