tex/nota-conjdados-regressao.tex
\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org75e9aa6}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1xv2lCPsj04FjGPQ\_BgPS9mrTIjBcyHQk/view?usp=sharing}{Birth Weight} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/Birthweight_reduced_kg_R.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  X...ID Length Birthweight Headcirc Gestation smoker mage mnocig mheight mppwt
1 1360   56     4.55        34       44        0      20   0      162     57   
2 1016   53     4.32        36       40        0      19   0      171     62   
3  462   58     4.10        39       41        0      35   0      172     58   
4 1187   53     4.07        38       44        0      20   0      174     68   
5  553   54     3.94        37       42        0      24   0      175     66   
  fage fedyrs fnocig fheight lowbwt mage35
1 23   10     35     179     0      0     
2 19   12      0     183     0      0     
3 31   16     25     185     0      1     
4 26   14     25     189     0      0     
5 30   12      0     184     0      0     
\end{verbatim}

\section{\href{https://www.sheffield.ac.uk/mash/statistics/datasets}{Crime}}
\label{sec:orgb32a1b8}
\begin{itemize}
\item \textbf{Modelar taxa de crime (\texttt{CrimeRate}) a partir das variáveis}.
\end{itemize}
\subsection{Dados sobre o \texttt{Conjunto}}
\label{sec:orga7c524d}
\begin{itemize}
\item Dados:
\begin{itemize}
\item CrimeRate: Taxa de criminalidade (ofensas por milhão de habitantes).
\item Youth: Jovens entre 18-24 anos a cada mil habitantes.
\item Southern: Estado do sul?
\item Education: Tempo de educação (anos de estudo até 25)
\item ExpenditureYear0: Dinheiro para segurança pública per capta.
\item LabourForce: Quantidade de jovens trabalhadores por 1000 habitantes.
\item Males: Homens (por cada 1000 mulheres).
\item MoreMales: Mais homens que mulheres?.
\item StateSize: Tamanho do estado em milhares.
\item YouthUnemployment: Desemprego de jovens por mil.
\item BelowWage: Número de famílias abaixo de meio salário por mil.
\item Wage: Salário médio semanal.
\item MatureUnemployment: Desemprego de sêniors (35-39) por mil.
\end{itemize}
\end{itemize}

\subsection{Invocação de conjuto, por arquivo local}
\label{sec:org442b85f}

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto \href{https://drive.google.com/file/d/1hZpHoEXbhZGvmtmrbcWpXYfBV-2ZD7uF/view?usp=sharing}{Crimes} da seguinte maneira.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos=false, bgcolor=LightGray]{r}
data <- read.csv('./data/csv/Crime_R.csv')
head(data,5)
\end{minted}

\begin{verbatim}
  X...CrimeRate Youth Southern Education ExpenditureYear0 LabourForce Males
1 45.5          135   0        12.4       69              540          965 
2 52.3          140   0        10.9       55              535         1045 
3 56.6          157   1        11.2       47              512          962 
4 60.3          139   1        11.9       46              480          968 
5 64.2          126   0        12.2      106              599          989 
  MoreMales StateSize YouthUnemployment ... ExpenditureYear10 LabourForce10
1 0          6         80               ... 71                564          
2 1          6        135               ... 54                540          
3 0         22         97               ... 44                529          
4 0         19        135               ... 41                497          
5 0         40         78               ... 97                602          
  Males10 MoreMales10 StateSize10 YouthUnemploy10 MatureUnemploy10
1  974    0            6           82             20              
2 1039    1            7          138             39              
3  959    0           24           98             33              
4  983    0           20          131             50              
5  989    0           42           79             24              
  HighYouthUnemploy10 Wage10 BelowWage10
1 1                   632    142        
2 1                   521    210        
3 0                   359    256        
4 0                   510    235        
5 1                   660    162        
\end{verbatim}

\section{\href{https://archive.ics.uci.edu/ml/datasets/Student+Performance\#}{Performance de Estudantes}}
\label{sec:org75078c3}
\begin{itemize}
\item \textbf{Modelar nota final (\texttt{G3}) a partir das variáveis}.
\end{itemize}
\subsection{Dados sobre o \texttt{Conjunto}}
\label{sec:orgf4e6b51}
\begin{itemize}
\item Dados:
\begin{itemize}
\item school - Escola em que estuda (binary: 'GP' - Gabriel Pereira ou 'MS' - Mousinho da Silveira)
\item sex - Sexo (binary: 'F' - mulher ou 'M' - homem)
\item age - Idade (numeric: from 15 to 22)
\item address - Estadia/tipo da região (binary: 'U' - urbana or 'R' - rural)
\item famsize - Tamanho familhar (binary: 'LE3' - menos que  3 or 'GT3' - mais que 3)
\item Pstatus - Estado de co-habitação dos pais (binary: 'T' - junto or 'A' - aparte)
\item Medu - Educação da mãe (numeric: 0 - nenhuma, 1 - primária (4th ano), 2 - 5th ao 9th ano, 3 - secundária, ou 4 - superior)
\item Fedu - Educação do pai (numeric: 0 - nenhuma, 1 - primária (4th ano), 2 - 5th ao 9th ano, 3 - secundária, ou 4 - superior)
\item Mjob - Tabalho da mãe (nominal: 'teacher', 'health' care related, civil 'services' (e.g. administrative or police), 'at\textsubscript{home}' or 'other')
\item Fjob - Trabalho do pai (nominal: 'teacher', 'health' care related, civil 'services' (e.g. administrative or police), 'at\textsubscript{home}' or 'other')
\item reason - Razão de escolha da escola (nominal: close to 'home', school 'reputation', 'course' preference or 'other')
\item guardian - Guardião legal (nominal: 'mother', 'father' or 'other')
\item traveltime - Tempo de viagem, escola à casa (numeric: 1 - <15 min., 2 - 15 to 30 min., 3 - 30 min. to 1 hour, or 4 - >1 hour)
\item studytime - Tempo de estudo semanal (numeric: 1 - <2 hours, 2 - 2 to 5 hours, 3 - 5 to 10 hours, or 4 - >10 hours)
\item failures - Número de reprovações (numeric: n if 1<=n<3, else 4)
\item schoolsup - Suporte educacional extra (binary: yes or no)
\item famsup - Suporte educacional familiar (binary: yes or no)
\item paid - Classes extras pagas (Math or Portuguese) (binary: yes or no)
\item activities - Atividades extra-curriculares (binary: yes or no)
\item nursery - Atendeu a clases de enfermaria (binary: yes or no)
\item higher - Quer seguir educação superior (binary: yes or no)
\item internet - Acesso a internet (binary: yes or no)
\item romantic - Em relação romántica (binary: yes or no)
\item famrel - Qualidade de relação familiar (numeric: from 1 - very bad to 5 - excellent)
\item freetime - Tempo livre fora da escola (numeric: from 1 - very low to 5 - very high)
\item goout - Tempo gasto saindo com amigos (numeric: from 1 - very low to 5 - very high)
\item Dalc - Consumo diário de álcool (numeric: from 1 - very low to 5 - very high)
\item Walc - Consumo em finais de semana de alcool (numeric: from 1 - very low to 5 - very high)
\item health - Estado de saúde atual (numeric: from 1 - very bad to 5 - very good)
\item absences - Número de faltas (numeric: from 0 to 93)
\item G1 - Notas primeiro período (numeric: from 0 to 20) [relacionadas com português ou matemática]
\item G2 - Nota segundo período (numeric: from 0 to 20) [relacionadas com português ou matemática]
\end{itemize}
\end{itemize}

\begin{itemize}
\item G3 - Nota final (numeric: from 0 to 20, output target) [relacionadas com português ou matemática]
\end{itemize}
