nota-conjdados-regressao.org
*** Invocação de conjuto, por arquivo local

Dado que você copiou os conjunto(s) de dado(s) para um diretório
local, pode-se chamar o conjunto de métricas e notas de [[https://drive.google.com/file/d/1vrIpfxXLxqo4ngPDOBjyrJFhB-Ei5N4C/view?usp=sharing][Português]] e [[https://drive.google.com/file/d/1FO2LEQhKbCX8cq6yBxqKzjrbnR18OxSD/view?usp=sharing][Matemática]] da seguinte maneira,

#+NAME: c1130a82-15eb-45f0-94f1-75d9fb5f2633
#+begin_src ein-r :session localhost :results output :exports both :eval no 
  data_mat=read.table("./data/csv/student-mat.csv",sep=";",header=TRUE)
  data_por=read.table("./data/csv/student-por.csv",sep=";",header=TRUE)

  data=merge(data_mat,data_por,by=c("school","sex","age","address","famsize","Pstatus","Medu","Fedu","Mjob","Fjob","reason","nursery","internet"))
  print(nrow(data)) # 382 dados

  head(data,5)
#+end_src

#+RESULTS: c1130a82-15eb-45f0-94f1-75d9fb5f2633
#+begin_example
[1] 382
  school sex age address famsize Pstatus Medu Fedu Mjob     Fjob     ...
1 GP     F   15  R       GT3     T       1    1    at_home  other    ...
2 GP     F   15  R       GT3     T       1    1    other    other    ...
3 GP     F   15  R       GT3     T       2    2    at_home  other    ...
4 GP     F   15  R       GT3     T       2    4    services health   ...
5 GP     F   15  R       GT3     T       3    3    services services ...
  famrel.y freetime.y goout.y Dalc.y Walc.y health.y absences.y G1.y G2.y G3.y
1 3        1          2       1      1      1        4          13   13   13  
2 3        3          4       2      4      5        2          13   11   11  
3 4        3          1       1      1      2        8          14   13   12  
4 4        3          2       1      1      5        2          10   11   10  
5 4        2          1       2      3      3        2          13   13   13  
#+end_example

#+NAME: eda681c5-86c3-42de-86b0-6e9f8ef1ae78
#+begin_src ein-r :session localhost :results output :exports both :eval no
  summary(data)
#+end_src

#+RESULTS: eda681c5-86c3-42de-86b0-6e9f8ef1ae78
#+begin_example
    school              sex                 age          address         
 Length:382         Length:382         Min.   :15.00   Length:382        
 Class :character   Class :character   1st Qu.:16.00   Class :character  
 Mode  :character   Mode  :character   Median :17.00   Mode  :character  
                                       Mean   :16.59                     
                                       3rd Qu.:17.00                     
                                       Max.   :22.00                     
   famsize            Pstatus               Medu            Fedu      
 Length:382         Length:382         Min.   :0.000   Min.   :0.000  
 Class :character   Class :character   1st Qu.:2.000   1st Qu.:2.000  
 Mode  :character   Mode  :character   Median :3.000   Median :3.000  
                                       Mean   :2.806   Mean   :2.565  
                                       3rd Qu.:4.000   3rd Qu.:4.000  
                                       Max.   :4.000   Max.   :4.000  
     Mjob               Fjob              reason            nursery         
 Length:382         Length:382         Length:382         Length:382        
 Class :character   Class :character   Class :character   Class :character  
 Mode  :character   Mode  :character   Mode  :character   Mode  :character  
                                                                            
                                                                            
                                                                            
   internet          guardian.x         traveltime.x    studytime.x   
 Length:382         Length:382         Min.   :1.000   Min.   :1.000  
 Class :character   Class :character   1st Qu.:1.000   1st Qu.:1.000  
 Mode  :character   Mode  :character   Median :1.000   Median :2.000  
                                       Mean   :1.442   Mean   :2.034  
                                       3rd Qu.:2.000   3rd Qu.:2.000  
                                       Max.   :4.000   Max.   :4.000  
   failures.x     schoolsup.x          famsup.x            paid.x         
 Min.   :0.0000   Length:382         Length:382         Length:382        
 1st Qu.:0.0000   Class :character   Class :character   Class :character  
 Median :0.0000   Mode  :character   Mode  :character   Mode  :character  
 Mean   :0.2906                                                           
 3rd Qu.:0.0000                                                           
 Max.   :3.0000                                                           
 activities.x         higher.x          romantic.x           famrel.x   
 Length:382         Length:382         Length:382         Min.   :1.00  
 Class :character   Class :character   Class :character   1st Qu.:4.00  
 Mode  :character   Mode  :character   Mode  :character   Median :4.00  
                                                          Mean   :3.94  
                                                          3rd Qu.:5.00  
                                                          Max.   :5.00  
   freetime.x       goout.x          Dalc.x          Walc.x        health.x    
 Min.   :1.000   Min.   :1.000   Min.   :1.000   Min.   :1.00   Min.   :1.000  
 1st Qu.:3.000   1st Qu.:2.000   1st Qu.:1.000   1st Qu.:1.00   1st Qu.:3.000  
 Median :3.000   Median :3.000   Median :1.000   Median :2.00   Median :4.000  
 Mean   :3.223   Mean   :3.113   Mean   :1.474   Mean   :2.28   Mean   :3.579  
 3rd Qu.:4.000   3rd Qu.:4.000   3rd Qu.:2.000   3rd Qu.:3.00   3rd Qu.:5.000  
 Max.   :5.000   Max.   :5.000   Max.   :5.000   Max.   :5.00   Max.   :5.000  
   absences.x          G1.x            G2.x            G3.x      
 Min.   : 0.000   Min.   : 3.00   Min.   : 0.00   Min.   : 0.00  
 1st Qu.: 0.000   1st Qu.: 8.00   1st Qu.: 8.25   1st Qu.: 8.00  
 Median : 3.000   Median :10.50   Median :11.00   Median :11.00  
 Mean   : 5.319   Mean   :10.86   Mean   :10.71   Mean   :10.39  
 3rd Qu.: 8.000   3rd Qu.:13.00   3rd Qu.:13.00   3rd Qu.:14.00  
 Max.   :75.000   Max.   :19.00   Max.   :19.00   Max.   :20.00  
  guardian.y         traveltime.y    studytime.y      failures.y    
 Length:382         Min.   :1.000   Min.   :1.000   Min.   :0.0000  
 Class :character   1st Qu.:1.000   1st Qu.:1.000   1st Qu.:0.0000  
 Mode  :character   Median :1.000   Median :2.000   Median :0.0000  
                    Mean   :1.445   Mean   :2.039   Mean   :0.1414  
                    3rd Qu.:2.000   3rd Qu.:2.000   3rd Qu.:0.0000  
                    Max.   :4.000   Max.   :4.000   Max.   :3.0000  
 schoolsup.y          famsup.y            paid.y          activities.y      
 Length:382         Length:382         Length:382         Length:382        
 Class :character   Class :character   Class :character   Class :character  
 Mode  :character   Mode  :character   Mode  :character   Mode  :character  
                                                                            
                                                                            
                                                                            
   higher.y          romantic.y           famrel.y       freetime.y  
 Length:382         Length:382         Min.   :1.000   Min.   :1.00  
 Class :character   Class :character   1st Qu.:4.000   1st Qu.:3.00  
 Mode  :character   Mode  :character   Median :4.000   Median :3.00  
                                       Mean   :3.942   Mean   :3.23  
                                       3rd Qu.:5.000   3rd Qu.:4.00  
                                       Max.   :5.000   Max.   :5.00  
    goout.y          Dalc.y          Walc.y         health.y    
 Min.   :1.000   Min.   :1.000   Min.   :1.000   Min.   :1.000  
 1st Qu.:2.000   1st Qu.:1.000   1st Qu.:1.000   1st Qu.:3.000  
 Median :3.000   Median :1.000   Median :2.000   Median :4.000  
 Mean   :3.118   Mean   :1.476   Mean   :2.291   Mean   :3.576  
 3rd Qu.:4.000   3rd Qu.:2.000   3rd Qu.:3.000   3rd Qu.:5.000  
 Max.   :5.000   Max.   :5.000   Max.   :5.000   Max.   :5.000  
   absences.y          G1.y            G2.y            G3.y      
 Min.   : 0.000   Min.   : 0.00   Min.   : 5.00   Min.   : 0.00  
 1st Qu.: 0.000   1st Qu.:10.00   1st Qu.:11.00   1st Qu.:11.00  
 Median : 2.000   Median :12.00   Median :12.00   Median :13.00  
 Mean   : 3.673   Mean   :12.11   Mean   :12.24   Mean   :12.52  
 3rd Qu.: 6.000   3rd Qu.:14.00   3rd Qu.:14.00   3rd Qu.:14.00  
 Max.   :32.000   Max.   :19.00   Max.   :19.00   Max.   :19.00  
#+end_example




LOM3095 quarta - 14h-16h tarde
LOM3224 segunda - 14h-18h tarde
